# AnalyticalSupportChecking Class (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalSupportChecking Class
Members See Also
---
Utilities that allow for detection of incorrect or incomplete analytical supports.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public static class AnalyticalSupportChecking
```

Visual Basic
---
```text
Public NotInheritable Class AnalyticalSupportChecking
```

Visual C++
---
```text
public ref class AnalyticalSupportChecking abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..AnalyticalSupportChecking
# See Also
AnalyticalSupportChecking Members
Autodesk.Revit.DB.Structure Namespace